SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_СЕССИЯ.УЧГОД FROM Н_ЛЮДИ JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД WHERE Н_ЛЮДИ.ОТЧЕСТВО > 'Владимирович' AND Н_СЕССИЯ.УЧГОД < '2001/2002' AND Н_СЕССИЯ.УЧГОД = '2003/2004';

SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ДАТА, Н_СЕССИЯ.УЧГОД FROM Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД LEFT JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД WHERE Н_ЛЮДИ.ИМЯ = 'Роман' AND Н_ВЕДОМОСТИ.ДАТА > '2010-06-18';

SELECT COUNT(*) != 0 FROM Н_ЛЮДИ WHERE ИД IN (SELECT ЧЛВК_ИД FROM Н_УЧЕНИКИ WHERE ПЛАН_ИД IN (SELECT ИД FROM Н_ПЛАНЫ WHERE ОТД_ИД IN (SELECT ИД FROM Н_ОТДЕЛЫ WHERE КОРОТКОЕ_ИМЯ ='КТиУ'))) AND ОТЧЕСТВО IN ('.', '', '-', NULL);

SELECT ФАМИЛИЯ, COUNT(*) FROM Н_ЛЮДИ 
LEFT JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
LEFT JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
LEFT JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
WHERE КОРОТКОЕ_ИМЯ ='КТиУ' GROUP BY ФАМИЛИЯ HAVING COUNT(*) < 10 AND ФАМИЛИЯ IN (SELECT ФАМИЛИЯ FROM Н_ЛЮДИ JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД);

WITH средняя_оценка_ученика AS (SELECT Н_УЧЕНИКИ.ИД, AVG(CASE
			WHEN ОЦЕНКА = '99' THEN 6
            WHEN ОЦЕНКА = '5' THEN 5
            WHEN ОЦЕНКА = '4' THEN 4
            WHEN ОЦЕНКА = '3' THEN 3
            WHEN ОЦЕНКА = 'зачет' THEN 2
            WHEN ОЦЕНКА = '2' THEN 1
            WHEN ОЦЕНКА = 'освобождение' THEN 0
            WHEN ОЦЕНКА = 'неявка' THEN 0
            WHEN ОЦЕНКА = 'незачет' THEN 0
            ELSE NULL END ) AS средняя_оценка FROM Н_ВЕДОМОСТИ JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД WHERE ГРУППА = '4100' GROUP BY Н_УЧЕНИКИ.ИД),

максимальная_оценка_группы AS (SELECT MAX(CASE
			WHEN ОЦЕНКА = '99' THEN 6
            WHEN ОЦЕНКА = '5' THEN 5
            WHEN ОЦЕНКА = '4' THEN 4
            WHEN ОЦЕНКА = '3' THEN 3
            WHEN ОЦЕНКА = 'зачет' THEN 2
            WHEN ОЦЕНКА = '2' THEN 1
            WHEN ОЦЕНКА = 'освобождение' THEN 0
            WHEN ОЦЕНКА = 'неявка' THEN 0
            WHEN ОЦЕНКА = 'незачет' THEN 0
            ELSE NULL END) AS макс_оценка FROM Н_ВЕДОМОСТИ
		JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД	WHERE ГРУППА = '1100')
SELECT 
    count(*)
FROM 
    средняя_оценка_ученика s,
    максимальная_оценка_группы m
WHERE 
    s.средняя_оценка < m.макс_оценка
;

SELECT ГРУППА, Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, П_ПРКОК_ИД, СОСТОЯНИЕ FROM Н_УЧЕНИКИ JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД WHERE ПЛАН_ИД IN (SELECT ИД FROM Н_ПЛАНЫ WHERE КУРС = 1 AND ФО_ИД IN (SELECT ИД FROM Н_ФОРМЫ_ОБУЧЕНИЯ WHERE НАИМЕНОВАНИЕ = 'Очная')) AND НАЧАЛО > '2012-09-01' AND ПРИЗНАК = 'обучен';

WITH средняя_оценка_ученика AS (SELECT ЧЛВК_ИД, AVG(CASE
            WHEN ОЦЕНКА = '5' THEN 5
            WHEN ОЦЕНКА = '4' THEN 4
            WHEN ОЦЕНКА = '3' THEN 3
            WHEN ОЦЕНКА = '2' THEN 2
            ELSE NULL END ) AS средняя_оценка FROM Н_ВЕДОМОСТИ WHERE ОЦЕНКА IN ('5', '4', '3', '2') GROUP BY Н_ВЕДОМОСТИ.ЧЛВК_ИД)
SELECT 
    COUNT(*)
FROM 
    средняя_оценка_ученика s
JOIN Н_УЧЕНИКИ ON s.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД 
WHERE 
    s.средняя_оценка >= 4 AND Н_УЧЕНИКИ.ГРУППА = '3100';



WITH средняя_оценка_ученика AS (SELECT ЧЛВК_ИД, AVG(CASE
            WHEN ОЦЕНКА = '5' THEN 5
            WHEN ОЦЕНКА = '4' THEN 4
            WHEN ОЦЕНКА = '3' THEN 3
            WHEN ОЦЕНКА = '2' THEN 2
            ELSE NULL END ) AS средняя_оценка FROM Н_ВЕДОМОСТИ 
            WHERE ОЦЕНКА IN ('5', '4', '3', '2') GROUP BY Н_ВЕДОМОСТИ.ЧЛВК_ИД),

максимальная_оценка_группы AS (SELECT MAX(CASE
            WHEN ОЦЕНКА = '5' THEN 5
            WHEN ОЦЕНКА = '4' THEN 4
            WHEN ОЦЕНКА = '3' THEN 3
            WHEN ОЦЕНКА = '2' THEN 2
            ELSE NULL END) AS макс_оценка FROM Н_ВЕДОМОСТИ
            JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД WHERE ОЦЕНКА IN ('5', '4', '3', '2') AND ГРУППА = '1100')
SELECT 
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО,
    Н_УЧЕНИКИ.ИД,
    s.средняя_оценка
FROM 
    средняя_оценка_ученика s,
    максимальная_оценка_группы m
JOIN Н_УЧЕНИКИ ON s.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ЛЮДИ ON s.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE 
    s.средняя_оценка >= m.макс_оценка
;

WITH средняя_оценка_ученика AS (SELECT ЧЛВК_ИД, AVG(CASE
            WHEN ОЦЕНКА = '5' THEN 5
            WHEN ОЦЕНКА = '4' THEN 4
            WHEN ОЦЕНКА = '3' THEN 3
            WHEN ОЦЕНКА = '2' THEN 2
            ELSE NULL END ) AS средняя_оценка FROM Н_ВЕДОМОСТИ 
            WHERE ОЦЕНКА IN ('5', '4', '3', '2') GROUP BY Н_ВЕДОМОСТИ.ЧЛВК_ИД),
максимальная_оценка_группы AS (SELECT MAX(CASE
            WHEN ОЦЕНКА = '5' THEN 5
            WHEN ОЦЕНКА = '4' THEN 4
            WHEN ОЦЕНКА = '3' THEN 3
            WHEN ОЦЕНКА = '2' THEN 2
            ELSE NULL END) AS макс_оценка FROM Н_ВЕДОМОСТИ
            JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД WHERE ОЦЕНКА IN ('5', '4', '3', '2') AND ГРУППА = '1100')
SELECT 
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО,
    Н_УЧЕНИКИ.ИД,
    s.средняя_оценка
FROM 
    средняя_оценка_ученика s
JOIN Н_УЧЕНИКИ ON s.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ЛЮДИ ON s.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE s.средняя_оценка > (SELECT m.макс_оценка FROM максимальная_оценка_группы m);


WITH максимальная_оценка_группы AS (SELECT MAX(CASE
            WHEN ОЦЕНКА = '5' THEN 5
            WHEN ОЦЕНКА = '4' THEN 4
            WHEN ОЦЕНКА = '3' THEN 3
            WHEN ОЦЕНКА = '2' THEN 2
            ELSE NULL END) AS макс_оценка FROM Н_ВЕДОМОСТИ
            JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД WHERE ОЦЕНКА IN ('5', '4', '3', '2') AND ГРУППА = '1100')
SELECT m.макс_оценка FROM максимальная_оценка_группы m;